# Table of Contents:
Note.- This only works in VS Studio. For Github see Readme TOC.

TOC --> 
- [Sprint 6 Task 1: Task data, probabilities and statistics](#sprint-6-task-1--task-data--probabilities-and-statistics)
- [Description](#description)
- [Level 1](#level-1)
    - [Exercise 1](#exercise-1)
    - [Exercise 2](#exercise-2)
- [Level 2](#level-2)
    - [Exercise 3](#exercise-3)
- [Level 3](#level-2)
    - [Exercise 4](#exercise-2)
<!-- /TOC

# Sprint 6 Task 1: Task data, probabilities and statistics

## Description
Learn how to perform statistics with Python.

Level 1
- Exercise 1.
Take a sports-themed data set that you like and select an attribute from the data set.  Calculate the mode, mean, standard deviation and arithmetic mean. 

- Exercise 2
Continuing with the sports-themed data, select two attributes and calculate their correlation. 

Level 2
- Exercise 3
Continuing with the sports-themed data, calculate the correlation of all attributes with each other and represent them in a matrix with different colors of intensity.

Level 3
- Exercise 4
Continuing with the sports-themed data, select an attribute and calculate the geometric median and the harmonic median.

In [1]:
# Import Libraries
import numpy as np
import pandas as pd

In [2]:
import warnings
# warnings.filterwarnings('ignore')
warnings.filterwarnings("default")

## Level 1
### Exercise 1
Take a sports-themed data set that you like and select an attribute from the data set.  Calculate the mode, mean, standard deviation and arithmetic mean.

We will take the following dataset from Kaggle:
Data scientist salary: ðŸ—¨ï¸ https://www.kaggle.com/nikhilbhathi/data-scientist-salary-us-glassdoor

In [3]:
df = pd.read_csv('./data_cleaned_2021.csv')
df

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,tensor,hadoop,tableau,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree
0,0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,0,0,1,1,0,0,0,data scientist,na,M
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,0,0,0,data scientist,na,M
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,0,0,0,data scientist,na,M
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,0,0,0,data scientist,na,na
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,0,0,0,data scientist,na,na
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,...,0,0,0,0,0,0,0,other scientist,sr,M
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,0,1,0,0,0,0,0,data engineer,sr,na
739,952,"Project Scientist - Auton Lab, Robotics Institute",$56K-$91K (Glassdoor est.),The Auton Lab at Carnegie Mellon University is...,2.6,Software Engineering Institute\n2.6,"Pittsburgh, PA","Pittsburgh, PA",501 - 1000,1984,...,0,0,0,0,0,0,0,other scientist,na,P
740,953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,...,0,0,0,0,0,0,0,data scientist,na,na
741,955,Research Scientist â€“ Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,...,0,0,0,0,0,0,0,other scientist,na,M

## Data meaning:  
**Context**  
>This dataset was made by scrapping the job postings related to the position of 'Data Scientist' from www.glassdoor.com in USA, I used selenium to scrap the data. After scrapping the raw data, I removed the duplicated rows from it which reduced the records from 1000 to 742. After this, several simplifications were performed to make the data user friendly for further data analysis and modelling.

**Content**  
>With each job, I got the following columns: Job title, Salary Estimate, Job Description, Rating, Company, Location, Company , Headquarters, , , any Size, Company Founded Date, Type of Ownership, Industry, Sector, Revenue, Competitors.

>Note: Columns with value -1 means either the data scraping was unsuccessful for that or the data was not present.

**Columns**  

|Column Name  |Description  |
|---------|---------|
|Job Title         | The title of job, eg. Data scientist, junior data scientist, senior data scientist etc  |
|Salary Estimate   | Range of salary and the source  |
|Job Description   | Tells us what qualities that company want and what is expected out of the job title|
Rating |It gives the rating of the company
Salary Estimate   | Range of salary and the source  
Company Name      | Name of the company  
Location          | Location of the job  
Headquarters      | Location of headquarter of the company  
Size              | Range of number of employee working in the company  
Founded           | Company founded in year  
Type of ownership | Tells us if the company is private, public or government owned  
Industry          | Industry like IT industry, Pharmaceutical industry etc  
Sector            | Sector in which company works  
Revenue           | Total revennue of the company per year  
Competitors       | Current competitors of the company
Hourly            | 1: If salary was reported in hourly rate. 0: Otherwise
Employer provided | 1: If the salary was provided by the employer 0: Otherwise  
Lower Salary      | Minimum Salary reported for the job in a particular company.  
Upper Salary      | Maximum salary reported for the job in a particular company.  
Avg Salary(K)     | Average salary reported for the job in a particular company.
company_txt       | It contains the name of the company  
Job Location      | Cleaned job location (State) column
Age               | Age of the company (in yrs)
Python            | 1: If Python skill is required 0: Otherwise
spark             | 1: If Spark skill is required 0: Otherwise
aws               | 1: If AWS skill is required 0: Otherwise
excel             | 1: If Excel skill is required 0: Otherwise  
sql               | 1: If Excel SQL is required 0: Otherwise
sas               | 1: If SAS skill is required 0: Otherwise
keras             | 1: If Keras skill is required 0: Otherwise
pytorch           | 1: If Pytorch skill is required 0: Otherwise
scikit            | 1: If Scikit skill is required 0: Otherwise
tensor            | 1: If Tensor skill is required 0: Otherwise
hadoop            | 1: If Hadoop skill is required 0: Otherwise
tableau           | 1: If Tableau skill is required 0: Otherwise  
bi                | 1: If PowerBi skill is required 0: Otherwise  
flink             | 1: If Flink skill is required 0: Otherwise
mongo             | 1: If MangoDB skill is required 0: Otherwise
google_an         | 1: If Google analytics certificate is required 0: Otherwise  
job_title_sim     | Simplified job title
seniority_by_title| Seniority in title  
Degree            | M: If the job title requires it or provide experience years for having it. 
| | P: If the job title requires it or provide experience years for having it.

In [4]:
# Let's pre-explore the dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 742 entries, 0 to 741
Data columns (total 42 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   index               742 non-null    int64
 1   Job Title           742 non-null    object
 2   Salary Estimate     742 non-null    object
 3   Job Description     742 non-null    object
 4   Rating              742 non-null    float64
 5   Company Name        742 non-null    object
 6   Location            742 non-null    object
 7   Headquarters        742 non-null    object
 8   Size                742 non-null    object
 9   Founded             742 non-null    int64
 10  Type of ownership   742 non-null    object
 11  Industry            742 non-null    object
 12  Sector              742 non-null    object
 13  Revenue             742 non-null    object
 14  Competitors         742 non-null    object
 15  Hourly              742 non-null    int64
 16  Employer provided   742 non-null    int64
 17  Lower Salary        742 non-null    int64
 18  Upper Salary        742 non-null    int64
 19  Avg Salary(K)       742 non-null    float64
 20  company_txt         742 non-null    object
 21  Job Location        742 non-null    object
 22  Age                 742 non-null    int64
 23  Python              742 non-null    int64
 24  spark               742 non-null    int64
 25  aws                 742 non-null    int64
 26  excel               742 non-null    int64
 27  sql                 742 non-null    int64
 28  sas                 742 non-null    int64
 29  keras               742 non-null    int64
 30  pytorch             742 non-null    int64
 31  scikit              742 non-null    int64
 32  tensor              742 non-null    int64
 33  hadoop              742 non-null    int64
 34  tableau             742 non-null    int64
 35  bi                  742 non-null    int64
 36  flink               742 non-null    int64
 37  mongo               742 non-null    int64
 38  google_an           742 non-null    int64
 39  job_title_sim       742 non-null    object
 40  seniority_by_title  742 non-null    object
 41  Degree              742 non-null    object
dtypes: float64(2), int64(23), object(17)
memory usage: 243.6+ KB

In [5]:
# Let's pre-explore the dataset
round(df.describe())

,index,Rating,Founded,Hourly,Employer provided,Lower Salary,Upper Salary,Avg Salary(K),Age,Python,...,keras,pytorch,scikit,tensor,hadoop,tableau,bi,flink,mongo,google_an
count,742.0,742.0,742.0,742.0,742.0,742.0,742.0,742.0,742.0,742.0,...,742.0,742.0,742.0,742.0,742.0,742.0,742.0,742.0,742.0,742.0
mean,469.0,4.0,1837.0,0.0,0.0,75.0,128.0,101.0,48.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
std,280.0,1.0,497.0,0.0,0.0,31.0,45.0,37.0,54.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
min,0.0,-1.0,-1.0,0.0,0.0,15.0,16.0,16.0,-1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
25%,222.0,3.0,1939.0,0.0,0.0,52.0,96.0,74.0,12.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
50%,472.0,4.0,1988.0,0.0,0.0,70.0,124.0,98.0,25.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
75%,708.0,4.0,2007.0,0.0,0.0,91.0,155.0,122.0,60.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
max,955.0,5.0,2019.0,1.0,1.0,202.0,306.0,254.0,277.0,1.0,...,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0

In [6]:
# Let's first clean our column's names:
df.columns

Index(['index', 'Job Title', 'Salary Estimate', 'Job Description', 'Rating',
       'Company Name', 'Location', 'Headquarters', 'Size', 'Founded',
       'Type of ownership', 'Industry', 'Sector', 'Revenue', 'Competitors',
       'Hourly', 'Employer provided', 'Lower Salary', 'Upper Salary',
       'Avg Salary(K)', 'company_txt', 'Job Location', 'Age', 'Python',
       'spark', 'aws', 'excel', 'sql', 'sas', 'keras', 'pytorch', 'scikit',
       'tensor', 'hadoop', 'tableau', 'bi', 'flink', 'mongo', 'google_an',
       'job_title_sim', 'seniority_by_title', 'Degree'],
      dtype='object')

In [7]:
df.columns = df.columns.str.lower()
df.columns = df.columns.str.replace(" ","_")
df.columns = df.columns.str.replace(r'\(k\)',"_k", regex=True)
df.columns

Index(['index', 'job_title', 'salary_estimate', 'job_description', 'rating',
       'company_name', 'location', 'headquarters', 'size', 'founded',
       'type_of_ownership', 'industry', 'sector', 'revenue', 'competitors',
       'hourly', 'employer_provided', 'lower_salary', 'upper_salary',
       'avg_salary_k', 'company_txt', 'job_location', 'age', 'python', 'spark',
       'aws', 'excel', 'sql', 'sas', 'keras', 'pytorch', 'scikit', 'tensor',
       'hadoop', 'tableau', 'bi', 'flink', 'mongo', 'google_an',
       'job_title_sim', 'seniority_by_title', 'degree'],
      dtype='object')

In [8]:
# Let's now focus on average salary (column 'avg_salary_k') for same job_title (column 'job_title_sim') (our main interest in this dataset)
df_salary = df [['job_title_sim','avg_salary_k']]
df_salary

       job_title_sim  avg_salary_k
0     data scientist          72.0
1     data scientist          87.5
2     data scientist          85.0
3     data scientist          76.5
4     data scientist         114.5
..               ...           ...
737  other scientist          84.5
738    data engineer         102.5
739  other scientist          73.5
740   data scientist         127.5
741  other scientist          93.5

[742 rows x 2 columns]

In [9]:
# let's explore the values on job_titles:
df_salary.job_title_sim.value_counts()

data scientist                    313
other scientist                   143
data engineer                     119
analyst                           101
machine learning engineer          22
Data scientist project manager     16
na                                 10
data analitics                      8
data modeler                        5
director                            5
Name: job_title_sim, dtype: int64

Let's now calculate mode, standard deviation and arithmetic mean.

MODE:

![](2022-02-02-18-48-42.png)

In [10]:
mode_salary = df[df_salary.job_title_sim =='data scientist'].avg_salary_k.mode()
print('The mode salary of a data scientist in US is: ',round(mode_salary[0]*1000),'$')
print('The mode salary of a data scientist in US is also: ',round(mode_salary[1]*1000),'$')

The mode salary of a data scientist in US is:  85000 $
The mode salary of a data scientist in US is also:  107000 $

Mode is the most occurring value in a list. So, in our column the values 85 and 107 are repeated the same amount of times.

STANDARD DEVIATION:

![](2022-02-02-18-43-05.png)
![](2022-02-02-18-45-29.png)

In [11]:
std_salary = df[df_salary.job_title_sim =='data scientist'].avg_salary_k.std()
print('The standard deviation in salary of a data scientist in US in this dataset is: ',round(std_salary*1000),'$')

The standard deviation in salary of a data scientist in US in this dataset is:  35864 $

ARITHMETIC MEAN:

![](2022-02-02-18-46-41.png)

In [12]:
avg_salary = df[df_salary.job_title_sim =='data scientist'].avg_salary_k.mean()
print('The average salary (mean) of a data scientist in US is: ',round(avg_salary*1000),'$')

The average salary (mean) of a data scientist in US is:  118294 $

LET'S ALSO CALCULATE THE MEDIAN:

![](2022-02-02-18-50-05.png)

In [13]:
median_salary = df[df_salary.job_title_sim =='data scientist'].avg_salary_k.median()
print('The median salary of a data scientist in US is: ',round(median_salary*1000),'$')

The median salary of a data scientist in US is:  113500 $

Finally, for an arbitrary probability density function, let's visualize all these statistical parameters.

![](2022-02-02-18-56-24.png)

### - Exercise 2
Continuing with the data, select two attributes and calculate their correlation. 

We are going to choose the attributes 'Rating' and 'Avg Salary(K)' for the 'job_title_sim' = 'data scientist' to see if there is a linear correlation.

In [18]:
# Let's try to do the filter in only 1 line, as Pythonicness says.
df[df.job_title_sim == 'data scientist'][['rating','avg_salary_k']].corr()

                rating  avg_salary_k
rating        1.000000     -0.097243
avg_salary_k -0.097243      1.000000

## Level 2
### - Exercise 3
Continuing with the sports-themed data, calculate the correlation of all attributes with each other and represent them in a matrix with different colors of intensity.


## Level 3
### - Exercise 4
Continuing with the sports-themed data, select an attribute and calculate the geometric median and the harmonic median.